snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВидОперации 	= МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, "ВидОперации");
	ДанныеВыбора	= Новый СписокЗначений;
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);
		
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ЗначениеЗаполнено(ВидОперации) Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МаркированныйТовар);
		
		СтандартнаяОбработка = Ложь;
	Иначе		
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МаркированныйТовар);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);	
	КонецЕсли;
КонецПроцедуры
